import NLP_package

class Mapa:

    himapa = {0: "Не приветствие", 1: "Приветствие"}
    qumapa = {0: "Не вопрос", 1: "Вопрос"}
    thmapa = {0: "Не благодарность", 1: "Благодарность"}
    commandmapa = {0: "Не команда", 1: "Команда"}

    multymapa = {0: "Нет темы", 1: "Погода", 2: "Дело"}
    emotionsmapa = {0: "😞", 1:"🤬", 2:"😨", 3:"😊", 4:"❤", 5:"😳", 6:""}

    hi_th_commandmapa = {0: "Утверждение", 1: "Команда", 2: "Приветствие", 3: "Благодарность"}

    def __init__(self):
        pass




